tutorials/qft_overview/chapter_1.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 21 Mar. 2024 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>QFT: Lay of the land</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Shrisha Rao">
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<main id="content">
<header>
<h1 class="title">QFT: Lay of the land</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org208f2c1">Lagrangian Formalism</a></li>
<li><a href="#orgcc43548">Spin 0</a>
<ul>
<li><a href="#org1c1270c">Lagrangian Density</a></li>
<li><a href="#orgb61c70a">Klien-Gordon Equation</a></li>
</ul>
</li>
<li><a href="#orgd8b0ca4">Spin 1/2:</a>
<ul>
<li><a href="#org3d90e6a">Dirac Lagrangian Density</a></li>
<li><a href="#orgfe49fe2">Dirac Equation</a></li>
</ul>
</li>
<li><a href="#org5b2efc6">Spin 1</a>
<ul>
<li><a href="#org0ca7013">Maxwell Lagrangian Density</a></li>
<li><a href="#org31df40b">Maxwell&rsquo;s Equations</a></li>
</ul>
</li>
<li><a href="#orge951a7a">Spin 2</a>
<ul>
<li><a href="#org6220fc0">Einstein-Hilbert Lagrangian Density</a></li>
<li><a href="#orgef02842">Einstein&rsquo;s Equations</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<script src="https://cdn.jsdelivr.net/npm/darkmode-js@1.5.7/lib/darkmode-js.min.js"></script>
<script>
  function addDarkmodeWidget() {
    new Darkmode({
      bottom: '695px', // Remove bottom positioning
      right: '20px', // Remove default right positioning
      left: 'unset', // Remove default left positioning
      label: '🌓', // Custom label/icon
      time: '0.5s', // Transition time
      autoMatchOsTheme: false, // Disable automatic theme matching based on OS preferences
      // location: 'top-right' // Set position to top right
    }).showWidget();
  }
  window.addEventListener('load', addDarkmodeWidget);
</script>


<section id="outline-container-org208f2c1" class="outline-2">
<h2 id="org208f2c1">Lagrangian Formalism</h2>
<div class="outline-text-2" id="text-org208f2c1">
<p>
todo
</p>
</div>
</section>


<section id="outline-container-orgcc43548" class="outline-2">
<h2 id="orgcc43548">Spin 0</h2>
<div class="outline-text-2" id="text-orgcc43548">
</div>
<div id="outline-container-org1c1270c" class="outline-3">
<h3 id="org1c1270c">Lagrangian Density</h3>
<div class="outline-text-3" id="text-org1c1270c">
\begin{align}
L &= -\frac{1}{2} \sum_{μ, ν} η^{μν} \frac{\partial φ}{x^μ}
      \frac{\partial φ}{x^ν} - \frac{1}{2} κ^2 φ^2 \\
&= \frac{1}{2} \left[ \Box φ - κ^2 φ^2 \right]
\end{align} 
</div>
</div>

<div id="outline-container-orgb61c70a" class="outline-3">
<h3 id="orgb61c70a">Klien-Gordon Equation</h3>
<div class="outline-text-3" id="text-orgb61c70a">
<p>
The equations of motion for a spin 0 particle is given by
</p>
\begin{equation}
\Box φ = κ^2 φ
\end{equation} 

<ul class="org-ul">
<li>E.g.: <b><b>Higgs Boson</b></b></li>
</ul>
</div>
</div>
</section>

<section id="outline-container-orgd8b0ca4" class="outline-2">
<h2 id="orgd8b0ca4">Spin 1/2:</h2>
<div class="outline-text-2" id="text-orgd8b0ca4">
</div>
<div id="outline-container-org3d90e6a" class="outline-3">
<h3 id="org3d90e6a">Dirac Lagrangian Density</h3>
<div class="outline-text-3" id="text-org3d90e6a">
\begin{equation}
L = i \sum_{μ} \bar{Ψ}\, γ^{μ} \frac{\partial}{\partial X^μ} Ψ
   - m\bar{Ψ}\, Ψ
\end{equation}
</div>
</div>

<div id="outline-container-orgfe49fe2" class="outline-3">
<h3 id="orgfe49fe2">Dirac Equation</h3>
<div class="outline-text-3" id="text-orgfe49fe2">
<p>
The equations of motion for a spin 1/2 particle is given by:
</p>
\begin{equation}
i \sum_{μ} γ^{μ} \frac{\partial}{\partial X^μ} Ψ = m Ψ
\end{equation}

<ul class="org-ul">
<li>E.g.: <b><b>Electron</b></b></li>
</ul>
</div>
</div>
</section>

<section id="outline-container-org5b2efc6" class="outline-2">
<h2 id="org5b2efc6">Spin 1</h2>
<div class="outline-text-2" id="text-org5b2efc6">
</div>
<div id="outline-container-org0ca7013" class="outline-3">
<h3 id="org0ca7013">Maxwell Lagrangian Density</h3>
<div class="outline-text-3" id="text-org0ca7013">
\begin{equation}
L = - \frac{1}{4} \sum_{μ, ν} F^{μν} F_{μν}
\end{equation}
</div>
</div>

<div id="outline-container-org31df40b" class="outline-3">
<h3 id="org31df40b">Maxwell&rsquo;s Equations</h3>
<div class="outline-text-3" id="text-org31df40b">
<p>
The equations of motion for a spin 1 particle is given by:
</p>
\begin{equation}
\sum_{μ, ν} F^{μν} = 0
\end{equation}

<ul class="org-ul">
<li>E.g.: <b><b>Photon</b></b></li>
</ul>
</div>
</div>
</section>

<section id="outline-container-orge951a7a" class="outline-2">
<h2 id="orge951a7a">Spin 2</h2>
<div class="outline-text-2" id="text-orge951a7a">
</div>
<div id="outline-container-org6220fc0" class="outline-3">
<h3 id="org6220fc0">Einstein-Hilbert Lagrangian Density</h3>
<div class="outline-text-3" id="text-org6220fc0">
\begin{equation}
L = \frac{1}{16 π G} g^{μν} R_{μν}
\end{equation}
</div>
</div>

<div id="outline-container-orgef02842" class="outline-3">
<h3 id="orgef02842">Einstein&rsquo;s Equations</h3>
<div class="outline-text-3" id="text-orgef02842">
<p>
The equations of motion for a spin 2 particle is given by: 
</p>
\begin{equation}
R_{μν} = 0
\end{equation}


<ul class="org-ul">
<li>E.g.: Graviton(?)</li>
</ul>
</div>
</div>
</section>
</main>
<footer id="postamble" class="status">
<p class="author">Author: Shrisha Rao</p>
<p class="date">Created: 21 Mar. 2024</p>
</footer>
</body>
</html>
